Revit.Elements.Tag
Revit Tag Element

Revit.Elements.Tag.InternalTextNote
Internal reference to the Revit Element

Revit.Elements.Tag.#ctor(Autodesk.Revit.DB.IndependentTag)
Tag
tag:

Revit.Elements.Tag.#ctor(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.TagOrientation,Autodesk.Revit.DB.TagMode,System.Boolean,Autodesk.Revit.DB.XYZ)
Tag by Element
view:
host:
orientation:
mode:
addLeader:
point:

Revit.Elements.Tag.InternalSetType(System.String,Autodesk.Revit.DB.XYZ,System.Double)
Set Text
value:
location:
angle:

Revit.Elements.Tag.InitElement(Autodesk.Revit.DB.IndependentTag)
Init element from existing
element:

Revit.Elements.Tag.Init(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.TagOrientation,Autodesk.Revit.DB.TagMode,System.Boolean,Autodesk.Revit.DB.XYZ)
Init Tag element
view:
host:
orientation:
mode:
addLeader:
vector:

Revit.Elements.Tag.GetLocationPoint(Revit.Elements.Element)
Gets element location from locationPoint or Curve
element:
Returns:

Revit.Elements.Tag.GetElementExtentsByView(Revit.Elements.Element,Autodesk.Revit.DB.View)
Get extents of an element by view
element:
view:

Revit.Elements.Tag.GetExtentsWithOffset(Revit.Elements.Element,Autodesk.Revit.DB.View,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.VerticalAlignmentStyle,Autodesk.Revit.DB.HorizontalAlignmentStyle)
Get element extents by view and apply offset vector
element:
view:
offset:
verticalAlignment:
horizontalAlignment:
Returns:

Revit.Elements.Tag.ByElement(Revit.Elements.Views.View,Revit.Elements.Element,System.Boolean,System.Boolean,System.String,System.String,Autodesk.DesignScript.Geometry.Vector,System.Boolean)
Create a Revit Tag for a Revit Element
view: View to Tag in
element: Element to tag
horizontal: Place tag horizontal
addLeader: Add a leader
offset: Optional: Offset Vector or Tag Location, defaults to 0,0,0
isOffset: Optional: Specifies if the point is being used as an offset vector or if it specifies the tags location, defaults to true
horizontalAlignment: Horizontal Alignment within the element's extents
verticalAlignment: Vertical Alignment within the element's extents
Returns:
tagelement,annotate,documentation

Revit.Elements.Tag.ByElementAndLocation(Revit.Elements.Views.View,Revit.Elements.Element,Autodesk.DesignScript.Geometry.Point,System.Boolean,System.Boolean)
Create a Revit Tag for a Revit Element at a specified location point
view: View to tag in
element: Element to tag
location: Location point
horizontal: Optional: Place tag horizontal, defaults to true
addLeader: Optional: Add a leader, defaults to false
Returns:
tagelement,annotate,documentation,taglocation

Revit.Elements.Tag.ByElementAndOffset(Revit.Elements.Views.View,Revit.Elements.Element,Autodesk.DesignScript.Geometry.Vector,System.String,System.String,System.Boolean,System.Boolean)
Create a Revit Tag for a Revit Element at an offset location
from the element's view extents
view: View to tag in
element: Element to tag
horizontal: Optional: Place tag horizontal,
defaults to true
addLeader: Optional: Add a leader, defaults to false
offset: Optional: Offset Vector, defaults to 0,0,0
horizontalAlignment: Optional: Horizontal Alignment
within the element's extents, defaults to Center
verticalAlignment: Optional: Vertical Alignment
within the element's extents, defaults to Middle
Returns:
tagelement,annotate,documentation,tagoffset,movetag

Revit.Elements.Tag.TagText
Get Tag's Text

Revit.Elements.Tag.TaggedElement
Get Tagged Element

Revit.Elements.Tag.FromExisting(Autodesk.Revit.DB.IndependentTag,System.Boolean)
Create form existing
instance:
isRevitOwned:
Returns: